artillery-load-test.yml
config:
  target: "http://localhost:5000"
  phases:
    # Warm up phase - gradually increase load
    - duration: 60
      arrivalRate: 5
      name: "Warm up"

    # Ramp up phase - increase to 300 concurrent users
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up to peak load"

    # Sustained load - maintain 300 users
    - duration: 300
      arrivalRate: 50
      name: "Sustained peak load (300 concurrent users)"

    # Cool down
    - duration: 60
      arrivalRate: 10
      name: "Cool down"

  processor: "./load-test-processor.js"

scenarios:
  # Test leaderboard endpoint (most frequently accessed)
  - name: "View Leaderboard"
    weight: 40
    flow:
      - get:
          url: "/api/teams/leaderboard"
          expect:
            - statusCode: 200
            - contentType: json

  # Test team login
  - name: "Team Login"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login-team"
          json:
            teamId: "HACK26-TEST1"
            email: "test@example.com"
          expect:
            - statusCode: [200, 401]

  # Test getting user data (authenticated)
  - name: "Get User Data"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login-team"
          json:
            teamId: "HACK26-TEST1"
            email: "test@example.com"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/auth/me"
          headers:
            Authorization: "Bearer {{ token }}"

  # Test getting attendance locks
  - name: "Get Attendance Locks"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login-team"
          json:
            teamId: "HACK26-TEST1"
            email: "test@example.com"
          capture:
            - json: "$.token"
              as: "token"
      - get:
          url: "/api/teams/attendance/lock"
          headers:
            Authorization: "Bearer {{ token }}"